-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 16, 2024 at 11:02 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `book_store`
--

-- --------------------------------------------------------

--
-- Table structure for table `bookcategories`
--

CREATE TABLE `bookcategories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `num_book` int(11) NOT NULL,
  `name_book` varchar(255) NOT NULL,
  `book` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `bookcategories`
--

INSERT INTO `bookcategories` (`id`, `num_book`, `name_book`, `book`, `created_at`, `updated_at`) VALUES
(1, 100, 'ปรัชญา', '1', NULL, NULL),
(2, 200, 'ศาสนา', '2', NULL, NULL),
(3, 300, 'สังคมศาสตร์', '3', NULL, NULL),
(4, 400, 'ภาษาศาสตร์', '4', NULL, NULL),
(5, 500, 'วิทยาศาสตร์', '5', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `books`
--

CREATE TABLE `books` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `ctgy_book` int(11) NOT NULL,
  `title` varchar(255) DEFAULT NULL,
  `author` varchar(255) DEFAULT NULL,
  `publisher` varchar(255) DEFAULT NULL,
  `detail` text DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `price` double DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `books`
--

INSERT INTO `books` (`id`, `ctgy_book`, `title`, `author`, `publisher`, `detail`, `image`, `price`, `created_at`, `updated_at`) VALUES
(20, 2, 'ศาสนาแห่งจักรวาล', 'สม สุจีรา', 'รัชพล', 'บทที่ 1 \"จิตจักรวาล\" อธิบายถึง ความสัมพันธ์ระหว่างจักวาลกับสมองของมนุษย์\r\nบทที่ 2 \"ชีวิตหลังความตาย\" อธิบายถึง การเก็บข้อมูลของจิตหลังเสียชีวิต 31 ภพภูมิ\r\nบทที่ 3 \"พลังจักรวาล\" อธิบายเรื่อง การเข้าถึงพลังจักรวาล การใช้สมองซีกขวา\r\nบทที่ 4 \"ความรู้สึก\" วิธีการควบคุมความคิด ความรู้สึก เพื่อบรรลุปัญญาญาณ\r\nบทที่ 5 \"ความไม่เที่ยง\" อธิบายเรื่อง แคลคูลัส ปัจจุบันขณะ และ ความต่าง\r\nบทที่ 6 \"จักรวาล\" อธิบาย ขนาดของจักรวาล ทฤษฎีสัมพัทธภาพและควอนตัม\r\nบทที่ 7 \"สะสมบุญ\" ความรู้สึกที่สร้างบุญ และ สร้างกรรม สังควัตถุ 4 พรหมวิหาร 4\r\nบทที่ 8 \"ศาสนาแห่งจักรวาล\" ความคิดเห็นจองไอน์สไตน์ ต่อศาสนาแห่งจักรวาล', '20240215070158.jpg', 166, '2024-02-07 00:01:58', '2024-02-15 20:09:54'),
(21, 2, 'ศาสนา 101 (RELIGION 109)', 'ปีเตอร์ อาร์เชอร์', 'แอร์โรว์ มัลติมีเดีย', 'ตั้งแต่พระเยซูและความจริงอันสูงส่งสี่ประการไปจนถึงกงล้อแห่งการดำรงอยู่ของชาวพุทธ หนังสือเล่มนี้ให้ข้อมูลเชิงลึกที่กระตุ้นความคิดเกี่ยวกับขนบธรรมเนียมและความเชื่อของศาสนาที่มีร่วมกัน เช่น ศาสนาคริสต์ ศาสนายิว ศาสนาพุทธ และศาสนาอิสลาม ภายในคุณยังจะค้นพบข้อเท็จจริงทางศาสนา ภาพประกอบ และปริศนาความคิดที่สำคัญหลายร้อยรายการที่คุณจะไม่สามารถหาได้จากที่อื่น', '20240215070302.jpg', 351, '2024-02-15 00:03:02', '2024-02-16 02:59:52'),
(22, 2, 'ศาสนาคือโรงพยาบาลโลก', 'พุทธทาสภิกขุ', 'สุขภาพใจ/Sukkhapabjai', 'อยู่กับโลกซึ่งขณะนี้เราต่างล้วนต้องการคู่มือที่จะอยู่กับโลกทั้งสองให้อยู่ได้เหนือทุกข์ เหนือโรค เหนือโลกทั้งปวง\r\n\r\n โลกนี้ หมายถึงโลกภายนอกทั้งหมดที่แวดล้อมตัวเราและโลกภายในตัวเรา โลกภายในใจ\r\n\r\n ศาสนาคือ โรงพยาบาลโลก   นี่แหละคือตัวแท้ของสิ่งที่เรียกว่าศาสนา.    \r\n\r\n    โลกนี้มีศาสนาแต่เพียงศาสนาเดียวคือ ศาสนาแห่งการกระทำเพื่อให้หลุดรอดจากความทุกข์ตามที่ตนเห็นว่าความทุกข์นั้นเป็นอย่างไรและเป็นสิ่งที่ควรได้รับความเคารพนับถืออย่างสม่ำเสมอกัน ไม่มีความรังเกียจเดียดฉันท์ซึ่งกันและกัน', '20240215070357.jpg', 50, '2024-02-15 00:03:57', '2024-02-15 00:03:57'),
(23, 2, 'ศาสนาคืออะไร', 'พระธรรมโกศาจารย์', 'อมรินทร์ธรรมะ', 'ศาสนาที่แท้จริงมันมีความหมายอย่างไร? มันก็มีความหมายตรงที่ว่า ช่วยให้มนุษย์พ้นจากความทุกข์ ระบบปฏิบัติอันใดมันช่วยให้มนุษย์พ้นจากความทุกข์ได้ ระบบนั้นชื่อว่าศาสนา ฉะนั้นเมื่อเราพูดว่า \"ศาสนาที่แท้จริงมีเพียงศาสนาเดียวในหมื่นโลกธาตุ\" นี้ เราต้องเล็งถึงระบบปฏิบัติที่ช่วยคน หรือช่วยสัตว์ทั้งหมื่นโลกธาตุ ให้พ้นจากทุกข์ทางจิตวิญญาณได้', '20240215070506.jpg', 165, '2024-02-15 00:05:06', '2024-02-15 00:06:36'),
(24, 2, 'ทำไมพุทธจึงเป็นศาสนาแห่งความจริง', 'โรเบิร์ต ไรท์ (Robert Write)', 'อมรินทร์ธรรมะ', 'ทำไมพุทธจึงเป็นศาสนาแห่งความจริง Why Buddhism Is True\r\n\r\nตามวิสัยของคนรุ่นใหม่ที่ไม่เชื่ออะไรง่ายๆ หนังสือเล่มนี้จะพาคุณเข้าสู่การวิเคราะห์ ถกเถียง วิพากษ์วิจารณ์ความจริงที่พุทธศาสนานำเสนอผ่านทฤษฏีจิตวิทยาวิวัฒนาการ ว่าความจริงคืออะไร และจริงอย่างไร แล้วคุณอาจพบคำตอบว่า ทำไมพุทธจึงเป็นศาสนาแห่งความจริง\r\n\r\nAMARIN Dhamma', '20240215070610.jpg', 265, '2024-02-01 00:06:10', '2024-02-15 00:14:35'),
(25, 1, 'ปรัชญากรีก: บ่อเกิดภูมิปัญญาตะวันตก', 'พระพรหมบัณฑิต(ประยูร ธมฺมจิตฺโต)', 'ศยาม/Sayam', 'หนังสือ ปรัชญากรีก : บ่อเกิดภูมิปัญญาตะวันตก ที่ท่านเจ้าคุณพระเมธีธรรมากรณ์* ได้เรียบเรียงไว้ นับว่าเป็นหนังสือดีมีคุณค่ายิ่งเล่มหนึ่ง การเรียบเรียงของท่านนับว่ามีหลักฐานที่มาน่าเชื่อถือ ทั้งท่านยังได้แสดงความคิดเห็นในเชิงวิเคราะห์ประกอบอีกส่วนหนึ่ง จึงนับว่ามีประโยชน์อย่างมากต่อนิสิตนักศึกษาหรือผู้ที่สนใจในความคิดของนักปรัชญาตะวันตกในสมัยโบราณหนังสือ ปรัชญากรีก : บ่อเกิดภูมิปัญญาตะวันตก จึงนับว่าเป็นหนังสือวิชาการที่มีคุณค่า สามารถนำไปศึกษาและอ้างอิงได้เป็นอย่างดียิ่ง', '20240215070819.jpg', 150, '2024-02-08 00:08:19', '2024-02-08 00:08:19'),
(26, 1, 'ปรัชญาเพื่อชีวิต \"ศิลปะแห่งความเป็นมนุษย์\"', 'พุทธธรรม', 'เพชรพินิจ', 'ปรัชญาเพื่อชีวิต \"ศิลปะแห่งความเป็นมนุษย์\"\r\nซิกมันด์ ฟรอยด์ ได้ชี้ให้เห็นถึงกระบวนการธรรมชาติของมนุษย์ในทัศนะของจิตวิเคราะห์ว่า... \"ที่ใดมีอิด (Id) ที่นั่นก็จะมีอีโก้ (Ego)\" จุดมุ่งหมายของฟรอยด์ คือ ต้องการให้เหตุผลซึ่งเป็นระดับจิตที่เป็นซูเปอร์อีโก้(Superego) เข้าไปครอบงำความต้องการที่ไร้เหตุผลซึ่งอยู่ในจิตไร้สำนึก(Id) โดยต้องการให้มนุษย์ได้รับการปลดปล่อยจากอำนาจแห่งจิตไร้สำนึกเท่าที่วิสัยมนุษย์จะทำได้ \"มนุษย์ จะต้องรู้จักพลังในจิตไร้สำนึกภายในตัวเอง ทั้งนี้ก็เพื่อจะได้ครอบงำ และควบคุมมันเอาไว้\" นั่นคือจุดมุ่งหมายของฟรอยด์ที่ต้องการให้มนุษย์รู้ความจริงมากที่สุด', '20240215070957.jpg', 234, '2024-02-01 00:09:57', '2024-02-15 00:09:57'),
(27, 1, 'ปรัชญาปารมิตาหฤทัยสูตร', 'ประมวล เพ็งจันทน์', 'SOOK Publishing', 'ผลงานเขียน เดินสู่อิสรภาพ ของอาจารย์ประมวล เพ็งจันทร์ ซึ่งบันทึกการเดินเท้าจากจังหวัดเชียงใหม่ ถึงเกาะสมุยบ้านเกิด ระยะทางกว่า ๑,๐๐๐ กิโลเมตร รวมเวลา ๖๖ วัน เป็นหนังสือที่ได้รับความนิยมและตรึงใจผู้อ่านมายาวนาน บางท่านอาจไม่ทราบว่า การเดินเท้าในครั้งนั้น อาจารย์ประมวลมิเพียงตั้งจิตเพื่อบรรลุเป้าหมายปลายทางอันเป็นรูปธรรมเท่านั้น หากแต่ทุกย่างก้าว ทุกลมหายใจเข้าออก ท่านกำลังเดินทางภายในเพื่อเข้าถึงหัวใจของปรัชญาปารมิตาหฤทัยสูตร', '20240215071105.jpg', 421, '2024-02-15 00:11:05', '2024-02-15 00:11:05'),
(28, 3, 'ติวเข้ม! เตรียมเข้า ม.4 สังคมศึกษา', 'ครูเดช สุรเดช ภาพันธ์', 'GANBATTE', 'เสริมพื้นฐานให้แน่นปึ้กก่อนสอบเข้าโรงเรียน ม.ปลาย ชั้นนำทั่วประเทศ\r\nสรุปเนื้อหา ม.1-3 แนวข้อสอบพร้อมเฉลยอย่างละเอียดและเทคนิคการจำต่างๆ ครบ!\r\nอ่านเตรียมสอบได้ทุกสนามไม่ว่าจะเป็นสนามสอบเข้า ม.ปลาย สนามสอบปลายภาค หรือสนามสอบ O-NET', '20240215071229.jpg', 344, '2024-02-15 00:12:29', '2024-02-15 00:12:29'),
(29, 3, 'A-Level สังคมศึกษา อัปเดตปีล่าสุด', 'กษิติ์เดช สุนทรานนท์', 'ธิงค์บียอนด์', 'เฉลยแนวข้อสอบ A-Level สังคมศึกษา ชุดที่ 1', '20240215071528.jpg', 301, '2024-02-15 00:15:28', '2024-02-15 00:15:28'),
(30, 4, 'ภาษาอังกฤษเพื่องานบริการ', 'ทิพากร เทพสุริวงศ์', 'หนังสือ 7D/7D BOOK', 'หากคุณกำลังมองหาหนังสือที่อ่านแล้วทำให้เราอยากออกไปผจญภัยใช้งานทันทีหนังสือเล่มนี้ตอบโจทย์ตรงจุด พูดแล้วเกิดต้องกล้าก่อน หยิบมาอ่านแล้วใช้งานได้เลยผู้เขียนเชื่อมโยงเข้าสู่ภาษาในการบริการลูกค้าเป็นหนังสือที่มีเอกลักษณ์เฉพาะตัวครอบคลุมทั้งเรื่อง', '20240215071620.jpg', 220, '2024-02-10 00:16:20', '2024-02-08 00:16:20'),
(31, 4, 'ภาษาจีน 360 องศา', 'พรรณิกา ชวนาทนุสรณ์', 'ไลฟ์ บาลานซ์ /Life Balance', 'เนื้อหาในหนังสือเล่มนี้ครอบคลุมทั้งตัวอักษรจีน สัทอักษร พินอิน ไวยากรณ์จีน บทสนทนาภาษาจีน และคำศัพท์หมวดต่างๆ เนื่องจากหนังสือเล่มนี้เขียนขึ้นเพื่อผู้อ่านทั่วไปที่อาจจะไม่มีพื้นฐานภาษาจีนมาก่อนได้ศึกษา ดังนั้น ส่วนที่เป็นภาษาจีน นอกจากจะมีสัทอักษรพินอินกำกับแล้ว ยังมีเสียงอ่านภาษาไทยกำกับเพิ่มเติมด้วย ทั้งนี้ผู้เขียนพยายามใช้เสียงภาษาไทยที่มีความใกล้เคียงกันมากที่สุด แต่ข้อควรระวังคือ เสียงภาษาไทยหลายเสียงไม่สามารถแทนเสียงภาษาจีนได้ตรงตัว ดังนั้นผู้อ่านจึงควรศึกษาสัทอักษรพินอินควบคู่กันไป เนื้อหาที่ผู้เขียนได้เรียบเรียงขึ้นนั้น อาศัยข้อมูลจากหนังสือสอนภาษาจีนหลายๆ เล่ม รวมทั้งความรู้ความเข้าใจภาษาจีนของผู้เขียนเอง ผู้เขียนหวังเป้นอย่างยิ่งว่าหนังสือเล่มนี้จะเป็นประโยชน์สำหรับผู้อ่าน โดยเฉพาะผู้ที่ต้องการศึกษาภาษาจีนด้วยตัว', '20240215071700.jpg', 188, '2024-02-15 00:17:00', '2024-02-15 00:17:00'),
(33, 4, 'ภาษาสเปนง่ายจังเลย', 'สว่างวัน ไตรเจริญวิวัฒน์', 'ศูนย์หนังสือจุฬา/chula', 'ภาษาที่มีผู้พูดเกือบ 600 ล้านคนทั่วโลกภาษาที่มีผู้พูดเป็นกาษาแม่มากเป็นอันดับสองของโลกเป็นกาษาที่ใช้ในโลกออนไลน์มากเป็นอันดับสามหนังสือที่เป็นกุญแจสำคัญที่ผู้เรียนเข้าถึงภาษาสเปน เขียนจากประสบการณ์การสอนกว่า 30 ปีทำเรื่องยาก ๆ อย่างไวยากรณ์ให้เป็นเรื่องง่ายเพราะอยากให้การเรียนกาษาเป็นเรื่องสบาย ๆจึงกลายเป็น \"ภาษาสเปนง่ายจัง\"', '20240215071743.jpg', 261, '2024-02-15 00:17:43', '2024-02-15 12:05:19'),
(34, 4, 'ภาษาสรรวรรณศัพท์', 'ปรัชญา ปานเกตุ', 'สถาพร/Sataporn books', 'หนังสือ ภาษาสรรวรรณศัพท์ เป็นงานเขียนของผู้ช่วยศาสตราจารย์ปรัชญา ปานเกตุ ต่อเนื่องจาก ศัพท์สรรพรรณนา เนื้อหามีลักษณะเดียวกันคือเรียบเรียงขึ้นจากคำที่ใช้กันอยู่ในสังคมไทยถิ่นต่างๆ ทั้งในอดีตและปัจจุบัน คำที่สรรมานี้เป็น “วรรณศัพท์” หมายถึงคำที่ปรากฏในวรรณกรรมลายลักษณ์ซึ่งผู้เขียนเก็บรวบรวมตัวอย่างจากเอกสารของราชการและภาคเอกชน รวมถึงการปรากฏใช้แบบมุขปาฐะที่เก็บรวบรวมตัวอย่างจากประสบการณ์ของตนเอง จากคำบอกเล่าของญาติ มิตรสหาย และลูกศิษย์ในชั้นเรียน ศัพท์ที่เลือกมาในชุดนี้ไม่ซ้ำกับชุดแรก แต่ยังคงเป็นศัพท์สำคัญในชีวิตประจำวันเช่นกัน มีทั้งคำ สำนวน ความเปรียบ ผู้เขียนใช้กลวิธีถ่ายทอดโดยอธิบายที่มาของคำหลักแล้วแตกลูกคำหรือคำที่เกี่ยวข้อง บอกความหมายทุกแง่ทุกมุม พร้อมตัวอย่างการใช้และกล่าวถึงภูมิหลังทางวัฒนธรรม ที่น่าสนใจคือการเชื่อมโยงระหว่างเรื่องจริงที่ผู้เขียนประสบเข้ากับความหมายของศัพท์แต่ละคำ เป็นการยืนยันว่าศัพท์ทุกคำยัง “มีชีวิต” กลวิธีการเขียนเช่นนี้เป็นลักษณะเด่นที่ทำให้คำศัพท์ธรรมดามีความหลากหลายลุ่มลึก ชวนติดตาม', '20240215071826.jpg', 542, '2024-02-10 00:18:26', '2024-02-15 00:18:26'),
(35, 4, 'ภาษาจักรวาล : ประวัติย่อของคณิต', 'อาจวรงค์ จันทมาศ', 'ดราก้อนวอร์/Dragon Wars', 'คณิตศาสตร์เป็นวิชาที่หลายคนอาจไม่ชอบ เวลาเรียนอาจจะง่วง เวลาใกล้สอบอาจรู้สึกเจ็บป่วย ส่วนหนึ่งเพราะไม่เข้าใจที่มาที่ไปของวิชานี้ว่ามันมีประโยชน์อย่างไร และเกี่ยวข้องกับชีวิตประจำวันอย่างไร ผมจึงตั้งใจเขียนหนังสือเล่มนี้ขึ้นมาเพื่อตอบโจทย์ดังกล่าว ให้คนที่เกี่ยวข้องกับการเรียนการสอนและบุคคลทั่วไปที่สนใจ อ่านแล้วเห็นภาพรวมของวิชานี้มากขึ้นแบบเข้าใจง่ายๆ \r\n\r\nไม่ว่าเราจะชอบคณิตศาสตร์หรือไม่ มันก็แทรกซึมอยู่รอบตัวเราและวิธีคิดของมนุษย์เราอย่างแยกไม่ออก ลองนึกถึงสังคมมนุษย์ที่นับจำนวนหรือบวกลบคูณหารไม่ได้ดูสิครับ อารยธรรมและกิจกรรมต่างๆคงไม่สามารถเกิดขึ้นได้เลย และในเมื่อทฤษฎีพื้นฐานทางวิทยาศาสตร์ที่ใช้บรรยายธรรมชาติก็เขียนในรูปคณิตศาสตร์ นักวิทยาศาสตร์ไม่น้อยจึงเชื่อว่าคณิตศาสตร์อาจเป็นภาษาที่มีความสากลที่สุดในเอกภพ อันเป็นที่มาของชื่อหนังสือเล่มนี้', '20240215071903.jpg', 231, '2024-02-09 00:19:03', '2024-02-15 00:20:41'),
(36, 5, 'วิทยาศาสตร์การทำความสะอาดบ้าน', 'มัตสึโมโตะ ทาดาโอะ', 'วีเลิร์น (WeLearn)', 'ครั้งแรกที่ “การทำความสะอาดบ้าน” ถูกอธิบายด้วยวิทยาศาสตร์พร้อมทั้งแนะนำวิธีการที่ถูกต้อง เป็นขั้นเป็นตอน และได้ผลจริง เพื่อให้บ้านคุณน่าอยู่ และส่งผลดีต่อคนในครอบครัวไปตลอดชีวิต', '20240215072008.jpg', 153, '2024-02-15 00:20:08', '2024-02-15 00:20:54'),
(37, 5, '74 INQUIRY EXPERIMENTS', 'Joachim Hecker', 'นานมีบุ๊คส์/nanmeebooks', 'รวบรวมการทดลองวิทยาศาสตร์กว่า 74 การทดลอง ที่จะทำให้เด็ก ๆ เข้าใจปรากฏการณ์ต่าง ๆ ในธรรมชาติ เช่น เสียงและการได้ยิน ภาพและการมองเห็น อากาศและความดัน แรง การลอยและการจม สารและความหนาแน่น', '20240215072143.jpg', 342, '2024-02-15 00:21:43', '2024-02-15 00:23:46'),
(38, 5, 'When วิทยาศาสตร์บนเข็มนาฬิกา', 'Daniel H.Pink', 'วีเลิร์น (WeLearn)', 'THE SCIENTIFIC SECRETS OF PERFECT TIMING\r\nทำไมคนเรามีโอกาสฆ่าตัวตายสูงเป็นพิเศษเมื่ออายุลงท้ายด้วยเลข 9?\r\nทำไมการหย่าร้างถึงมักเกิดขึ้นหลังช่วงเวลาแห่งความสุข?\r\nเวลาอันตรายที่ไม่ควรไปหาหมอคือกี่โมง?\r\nทำไมคนที่ไปร้องคาราโอเกะตามลำพังถึงมีโอกาสเป็นมะเร็งมากกว่า?\r\nทำไมความคิดสร้างสรรค์ถึงต้องการเดดไลน์?\r\n\r\nคำตอบที่อยู่ที่ \"จังหวะเวลา\"\r\nDaniel H. Pink จะพาคุณไปสำรวจโลกของวิทยาศาสตร์แห่งเวลา\r\nเพื่อทำความเข้าใจว่า \"จังหวะเวลา\" ส่งผลต่อชีวิตของคนเรามากแค่ไหน\r\nแล้วเราจะนำความเข้าใจนั้นมาปรับใช้อย่างไรให้สามารถตัดสินใจได้\r\nถูกต้องแม่นยำขึ้น \"เพราะในเสี้ยววินาทีที่คุณตัดสินใจจะทำหรือไม่ทำอะไร\r\nอาจส่งผลกับคุณไปนานนับปี...หรืออาจจะตลอดชีวิต', '20240215072225.jpg', 231, '2024-02-14 00:22:25', '2024-02-15 00:22:25'),
(39, 5, 'The Science of Sleep', 'HEATHER DARWALL-SMITH', 'วีเลิร์น (WeLearn)', 'ท่องไปในโลกแห่งนิทราอันน่าพิศวงเพื่อค้นพบกลไกที่จะช่วยให้คุณพักผ่อนเต็มอิ่มและพร้อมใช้ชีวิตในทุก ๆ วันเมื่อกลไกธรรมชาติที่อยู่คู่มนุษย์มานานหลายล้านปีกลับกลายเป็นปัญหาของผู้คนมากมายตลอดหลายทศวรรษที่ผ่านมา“วิทยาศาสตร์”  จะไขปริศนาและพาคุณไปพบคำตอบ!\r\n\r\n  เกิดอะไรขึ้นในโมงยามที่คุณหลับใหลไม่ได้สติ“การนอนหลับ”  ส่งผลอย่างไรต่อมิติอื่น ๆ ทั้งหมดในชีวิตทั้งร่างกาย  จิตใจ  ระดับพลังงาน  หรือแม้แต่โรคภัยไข้เจ็บที่คุณกำลังเผชิญอยู่\r\nแล้วคุณจะได้รู้ว่า…', '20240215072333.jpg', 564, '2024-02-16 00:23:33', '2024-02-15 00:23:33'),
(43, 3, 'หมายหมาย', 'สม', 'รัชพล', 'บทที่ 1 \"จิตจักรวาล\" อธิบายถึง ความสัมพันธ์ระหว่างจักวาลกับสมองของมนุษย์\r\nบทที่ 2 \"ชีวิตหลังความตาย\" อธิบายถึง การเก็บข้อมูลของจิตหลังเสียชีวิต 31 ภพภูมิ\r\nบทที่ 3 \"พลังจักรวาล\" อธิบายเรื่อง การเข้าถึงพลังจักรวาล การใช้สมองซีกขวา', '20240215190352.jpg', 233, '2024-02-15 12:03:52', '2024-02-15 12:03:52'),
(44, 2, 'ศาสนาแห่งจักรวาล', 'สม สุจีรา', 'รัชพล', 'บทที่ 1 \"จิตจักรวาล\" อธิบายถึง ความสัมพันธ์ระหว่างจักวาลกับสมองของมนุษย์\r\nบทที่ 2 \"ชีวิตหลังความตาย\" อธิบายถึง การเก็บข้อมูลของจิตหลังเสียชีวิต 31 ภพภูมิ\r\nบทที่ 3 \"พลังจักรวาล\" อธิบายเรื่อง การเข้าถึงพลังจักรวาล การใช้สมองซีกขวา', '20240216022605.jpg', 1232, '2024-02-15 19:26:05', '2024-02-15 19:26:05'),
(45, 2, 'ศาสนาแห่งจักรวาล', 'สม สุจีรา', 'รัชพล', 'บทที่ 1 \"จิตจักรวาล\" อธิบายถึง ความสัมพันธ์ระหว่างจักวาลกับสมองของมนุษย์\r\nบทที่ 2 \"ชีวิตหลังความตาย\" อธิบายถึง การเก็บข้อมูลของจิตหลังเสียชีวิต 31 ภพภูมิ\r\nบทที่ 3 \"พลังจักรวาล\" อธิบายเรื่อง การเข้าถึงพลังจักรวาล การใช้สมองซีกขวา', '20240216030740.jpg', 123, '2024-02-15 20:07:40', '2024-02-15 20:07:40');

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2024_02_14_034441_create_bookcategories_table', 1),
(2, '2014_10_12_000000_create_users_table', 2),
(3, '2014_10_12_100000_create_password_reset_tokens_table', 2),
(4, '2019_08_19_000000_create_failed_jobs_table', 2),
(5, '2019_12_14_000001_create_personal_access_tokens_table', 2),
(9, '2024_02_14_034110_create_books_table', 3);

-- --------------------------------------------------------

--
-- Table structure for table `password_reset_tokens`
--

CREATE TABLE `password_reset_tokens` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `token` varchar(64) NOT NULL,
  `abilities` text DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `bookcategories`
--
ALTER TABLE `bookcategories`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `bookcategories_book_unique` (`book`);

--
-- Indexes for table `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `password_reset_tokens`
--
ALTER TABLE `password_reset_tokens`
  ADD PRIMARY KEY (`email`);

--
-- Indexes for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `bookcategories`
--
ALTER TABLE `bookcategories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `books`
--
ALTER TABLE `books`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=46;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
